# ФИНАЛЬНОЕ ЗАДАНИЕ #

 > Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

>>Примеры: [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”] [“1234”, “1567”, “-2”, “computer science”] →  [“-2”] [“Russia”, “Denmark”, “Kazan”] → []

## Решение: ## 


>>> Сначала просим пользователя ввести размер его массива через Console.Write, чтобы пользователь заполняет массив с клавиатуры.

>>> Затем задаю массив array размером arraysize

>>> Задаю переменную i, как индекс элемента 

>>> Ввожу переменную count, как счётчик элементов массива для условия и вывожу на экран полученный при этом массив array. 

>>> Ввожу переменную maximumSimbol, чтобы обозначить какой должен быть максимальный размер итогового массива, в задаче указано, что максимум должно быть 3. 

>>> Прогоняем циклом for, пока индекс i меньше длины массива arraysize 

>>> Проверяю каждый элемент массива условием - длина массива должна быть  меньше либо равна maximumSimbol. Если условие работает, то увеличиваю count на один. Если не работает, то проверяем следующий элемент массива

